
class Messages:

    START_MSG = "مرحبا {}.\n\أنا روبوت رفع الفديوهات لليوتيول .يمكنك أن تستخدمني لتحميل أي فيديو من هنا وسارفعه  على اليوتيوب بمجرد أن ترسل لي الفديو لييمكنك معرفة المزيد اضغط /help

..\n\يعطيكم الصّحة."

    HELP_MSG = [
        ".",
        "مرحبا صديقي \n\n
أول شيء يجب أن تكون على علم أن يوتيوب يفحص  كل الفيديو التي تم تحميلها ، وتخضع لمراقبة حقوق الطبع والنشر  إذا وجد\n\n
انتقل الى الخطوات الاخرى لمعرفة طريقة تفعيل البوت",

        "🔹حسنا لتفعيل البوت قم بالتالي\n\n▪︎**الخطوة الأولى:** تقوم بربط اليوت بقناتك وتعطيني صلاحيه  أن أرفع إلى قناة يوتيوب الخاصة بك.المزيد عن هذا في الصفحات القادمه\n\n▪︎**الخطوة الثانية**: قم بتحويل اي ملف فديو الى هنا\n\n▪︎**الخطوة 3:** تقوم بالرد /upload على ملف الفيديو المحول الى البوت .يمكنك أيضا تحديد  العنوان في أمر الرفع ، لكنه اختياري على الرغم من ذلك.العنوان لكن اذا تم الرفع بدون عنوان  ، سيستخدم اسم الملف كعنوان.\n\n▪︎**الخطوة الرابعة:** أقوم بتحميل الملف عن بعد وتحميله على قناة اليوتيوب الخاصة بك.\n\n**▪︎الخطوة الخامسة:** أرسل لك رابط اليوتيوب بعد الرفع.
🔹 للاستفسار @haidarkrar","**🔹** اولا أنشئ قناة اليوتيوب الخاصة بك**\n\n🔹لا فائدة من استخدامي إن لم يكن لديك قناة يوتيوب  قم بصنع قناة  من خلال الخطوات التاليه بالاسفل .\n\n1⃣**الخطوة الأولى**: الدخول  على اليوتيوب على حاسوب أو باستخدام الهاتف النقال.\n\n2⃣**الخطوة الثانية:** جرب أي عمل يتطلب قناة ، مثل تحميل فيديو ، أو نشر تعليق ، أو إنشاء قائمة تشغيل.\n\n3⃣**الخطوة الثالثة:** إذا لم يكن لديك قناة بعد ، ابحث طريقة لإنشاء قناة.\n\n4⃣**الخطوة الرابعة:** التحقق من التفاصيل والتأكيد لإنشاء قناتك الجديدة.\n\n🔹 للاستفسار @haidarkrar","**تاكيد حسابك على اليوتيوب\n\n🔹اليوتيوب تأخذ الرسائل المزعجة والإساءة على محمل الجد لذا يطلب منك التحقق من حسابك على اليوتيوب بمجرد أن تتحقق من حسابك ، ستكون قادرا على تحميل\n\n الفيديوهات أكثر من 15 دقيقة. إذا لم تتحقق من حسابك كل فيديو تم تحميله والذي يزيد عن 15 دقيقة سيتم إزالته من قبل يوتيوب\n\n🔹 [تحقق من حسابك على اليوتيوب هنا..](http://www.youtube.com/verify)",
"**الآن قم بربط البوت بقناتك \n\n

●عليك أن تعطيني صلاحية تحميل الفيديوهات على حسابك على اليوتيوب من أجل ذلك افتح الحساب و اسمح بالدخول و نسخ الكود عد إلى هنا وأكتب الامر التالي 
/authorise الكود الي قمت بنسخه."
    ]

    NOT_A_REPLY_MSG = " قم بالرد على ملف الفديو بالامر التالي\n\n
\n\n.على سبيل المثال /upload اسم الملف"

    NOT_A_MEDIA_MSG = "  هذا لا يبدوا كملف فديو. "+NOT_A_REPLY_MSG

    NOT_A_VALID_MEDIA_MSG = "هذا ليس ملف وسائط"

    PROCESSING = "جاري الرف لليوتيوب....."

    NOT_AUTHENTICATED_MSG = " /help  للمساعدة المعذرة أولا يجب ربط البوت بقتاتك اليوتيوب وإعطائي الاذن لرفع الفديوهات  اضغط"

    NO_AUTH_CODE_MSG = "الكود غير موجود . يرجى إرسال  الكود"

    AUTH_SUCCESS_MSG = "مبرووك, لقد تم ربط قناتك اليوتيوب بالبوت بنجاح .\nاستمتع بالتحميل !"

    AUTH_FAILED_MSG = "فشل ربط القناة \nالتفاصيل  هنا :{}"
    
    AUTH_DATA_SAVE_SUCCESS = "تم حفظ البيانات بنجاح "
    
